package lesson_5;

public class HW5 {
    public static void main (String[] args) {
       // 1 Создать массив на 10 строк.
        // 2. Ввести с клавиатуры 8 строк и сохранить их в массив.
        // 3. Вывести содержимое всего массива (10 элементов) на экран в обратном порядке. Каждый элемент - с новой строки.



        // 2   1.1. Создай массив на 10 чисел
      //   1.2. Считай с консоли 10 чисел и заполни ими массив
        //  2. Найти максимальное число из элементов массива



       // 3 СО ЗВЕЗДОЧКОЙ
        // 1. Создать массив на 10 строк.
      //   2. Создать массив на 10 чисел.
      //   3. Ввести с клавиатуры 10 строк, заполнить ими массив строк.




      //  4. В каждую ячейку массива чисел записать длину строки из массива строк,
             //   индекс/номер ячейки которой совпадает с текущим индексом из массива чисел.



        // 4  1. Создать массив на 10 чисел.
       // 2. Ввести с клавиатуры 10 чисел и записать их в массив.
       // 3. Вывести на экран элементы массива в обратном порядке, каждое значение выводить с новой строки.



        // 5   1. Создать массив на 20 чисел.
       // 2. Ввести в него значения с клавиатуры.
       //  3. Создать два массива на 10 чисел каждый.
        //4. Скопировать большой массив в два маленьких: половину чисел в первый маленький, вторую половину во второй маленький.
      //  5. Вывести второй маленький массив на экран, каждое значение выводить с новой строки.



      //  6 Создать массив на 20 чисел.
        //   Заполнить его числами с клавиатуры.
       // Найти максимальное и минимальное числа в массиве.
        //   Вывести на экран максимальное и минимальное числа через пробел.



        // 7 Задача: Написать программу, которая вводит с клавиатуры 20 чисел и выводит их в убывающем порядке.



    }
}
